Revit.Properties.Resources.CannotGetBaseOrSurveyPoint
Looks up a localized string similar to Cannot get base or survey point from document..

Revit.Properties.Resources.CategoryArgumentException
Looks up a localized string similar to You must supply a Category..

Revit.Properties.Resources.CategoryVisibilityOverrideError
Looks up a localized string similar to Specified View Template is not valid for this View..

Revit.Properties.Resources.CurtainSystemTypeNotFound
Looks up a localized string similar to Curtain System Type not found..

Revit.Properties.Resources.CurveIsNotPlanar
Looks up a localized string similar to Curve ist not planar. Please supply a planar curve..

Revit.Properties.Resources.CurveLoopNotClosed
Looks up a localized string similar to Curves do not form a closed loop..

Revit.Properties.Resources.CurveRequired
Looks up a localized string similar to Please supply a curve geometry..

Revit.Properties.Resources.DirectShapeInvalidArgument
Looks up a localized string similar to Can only create DirectShapes from Solids, Surfaces or Meshes..

Revit.Properties.Resources.DocumentDoesNotSupportGlobalParams
Looks up a localized string similar to Document does not support global parameters..

Revit.Properties.Resources.DynamoSolidToRevitBRepFailure
Looks up a localized string similar to An unexpected failure occurred when attempting to convert the solid into a Revit BRep.

Revit.Properties.Resources.DynamoSurfaceToRevitBRepFailure
Looks up a localized string similar to An unexpected failure occurred when attempting to convert the surface into a Revit BRep.

Revit.Properties.Resources.ElementCannotBeAnnotatedError
Looks up a localized string similar to Element cannot be annotated.

Revit.Properties.Resources.ExportOptionsArgumentException
Looks up a localized string similar to Invalid Schedule Export Options..

Revit.Properties.Resources.GeometryConversionFailure
Looks up a localized string similar to One or more geometries have failed to convert due to this error: .

Revit.Properties.Resources.InvalidFace
Looks up a localized string similar to The selected face cannot be used to create a wall. Please use a mass face instead..

Revit.Properties.Resources.InvalidFilterType
Looks up a localized string similar to FilterType is not valid..

Revit.Properties.Resources.InvalidHost
Looks up a localized string similar to Element does not have a host..

Revit.Properties.Resources.InvalidShapeEditor
Looks up a localized string similar to Floor Shape cannot be edited..

Revit.Properties.Resources.MultipleCurvesIntroducedAfterConversion
Looks up a localized string similar to There are multiple curves converted from the input curve element..

Revit.Properties.Resources.MultipleSurfacesIntroducedAfterConversion
Looks up a localized string similar to There are multiple surfaces converted from the input face..

Revit.Properties.Resources.NameAlreadyInUse
Looks up a localized string similar to Name already in use..

Revit.Properties.Resources.NameArgumentException
Looks up a localized string similar to You must supply a Name..

Revit.Properties.Resources.NoSharedParameterFileFound
Looks up a localized string similar to No shared parameter file found..

Revit.Properties.Resources.NotEnoughDataError
Looks up a localized string similar to You need at least two elements for a dimension..

Revit.Properties.Resources.ParameterGroupNotFound
Looks up a localized string similar to Invalid parameter group..

Revit.Properties.Resources.ParameterTypeNotFound
Looks up a localized string similar to Invalid parameter type..

Revit.Properties.Resources.PointRequired
Looks up a localized string similar to Please supply a point geometry..

Revit.Properties.Resources.RoofTypeNotFound
Looks up a localized string similar to Roof type not found..

Revit.Properties.Resources.ScheduleExportError
Looks up a localized string similar to There was an error exporting this schedule..

Revit.Properties.Resources.ScheduleTypeArgumentException
Looks up a localized string similar to Invalid Schedule Type..

Revit.Properties.Resources.Sheet_NoViewsError
Looks up a localized string similar to Must supply more than 0 views.

Revit.Properties.Resources.TypeNotFound
Looks up a localized string similar to Type not found in document..

Revit.Properties.Resources.ViewDoesNotSupportAnnotations
Looks up a localized string similar to View does not support annotations..

Revit.Properties.Resources.ViewExportImageError
Looks up a localized string similar to There was an error exporting the image..

Revit.Properties.Resources.ViewPlan_ViewFamilyNotFound
Looks up a localized string similar to .